tap "felixkratz/formulae"
tap "nikitabobko/tap"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Fast, highly customisable system info script with LGBTQ+ pride flags
brew "hyfetch"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Multi-track audio editor and recorder
cask "audacity"
# Desktop password and login vault
cask "bitwarden"
# Voice and text chat software
cask "discord"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sketchybar-app-font"
# Desktop client for GitHub repositories
cask "github"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# GPU-based terminal emulator
cask "kitty"
# Visual diff and merge tool
cask "meld"
# Open-source software for live streaming and screen recording
cask "obs"
# VPN client focusing on security
cask "protonvpn"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
vscode "github.vscode-pull-request-github"
vscode "tamasfe.even-better-toml"
